# Chapter : 8 - item : 1 - AVL Tree มันทำยาก เผามันเลยละกัน

# พี่ว่าการสร้าง Tree มันยากเกินไปและใช้เวลานานมาก กว่าต้นไม้จะโต 
# เพราะฉะนั้นเราจะทำอะไรให้มันเร็วกว่าการปลูกต้นไม้ดีกว่า นั่นคือการ เผามันเลย ยังไงล่ะ

# โดยที่เดี๋ยวพี่จะจุดไฟใส่ กิ่ง หรือ ใบไม้สักใบนึง แล้วดูว่าพอเวลาผ่านไปทุกๆนาที 
# จะมีส่วนไหนของต้นไม้บ้างที่ไหม้เกรียมไปแล้วบ้าง

# หลักการทำงานคร่าวๆ
# สร้าง AVL Tree ด้วยความตั้งใจ (ตัวแรกไม่จำเป็นต้องเป็น Root เสมอไป)
# จุดไฟที่ node นั้น -> ถือว่า node นั้นไหม้ไปแล้ว
# ทุกๆนาที จะมี กิ่ง หรือ ใบ รอบๆข้างที่เชื่อมต่อกับ node นั้นไหม้ทั้งหมด
# โดยให้วนดูจาก left child node ของ node นั้นก่อนเสมอ
# ตามด้วย right child node
# ปิดท้ายด้วย parent node ของ node นั้น
# ถ้าไม่มี node ที่อยู่ติดกับ node ที่ไหม้ไปแล้ว ก็ปล่อยมันไป
# บอกพี่หน่อยว่า แต่ละนาที มี node ไหนที่ไหม้ไปบ้าง

# เช่น Testcase #1 : Node ที่จะเผาคือ Node(14)

#              14

#     12            21

# 10     13   15       23

#                         22 24

# Minute 0 : 14 (เผาอยู่)

# Minute 1 : 12 21 (ไฟลามไปทาง left child node แล้วค่อยไป right child node)

# Minute 2 : 10 13 15 23 (ไฟลามเหมือนเดิม วนไป)

# Minute 3 : 22 24 (Node(10), Node(13) ไม่มีตัวต่อแล้ว ก็ไม่ต้องสนอะไร
#  ไฟลามไป child ของ node ที่เหลือแทน)

# **************************************************
# พี่ ญ่า ตั้งใจออกข้อนี้มากเลยนะขอให้น้องๆตั้งใจทำนะ
# **************************************************